IDEA StatiCa Open Model
RebarStirrupPattern.Translation Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the local eccentricity in X and Y direction apply transfotmation at 3D (section 3D) then transform to 3D.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D Translation { get; set; }
Public Property Translation As Vector3D
	Get
	Set
public:
property Vector3D^ Translation {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
RebarStirrupPattern Class
IdeaRS.OpenModel.Model Namespace